AUV_1_to_1_surge/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          16384;
        startFace       1552384;
    }
    inlet
    {
        type            patch;
        nFaces          4096;
        startFace       1568768;
    }
    outlet
    {
        type            patch;
        nFaces          4096;
        startFace       1572864;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8192;
        startFace       1576960;
    }
    upperWall
    {
        type            patch;
        nFaces          8192;
        startFace       1585152;
    }
)

// ************************************************************************* //
